supporting_tips = [
    "Не сдавайтесь! Маленькие шаги ведут к большим результатам 💪",
    "Иногда прогресс нелинеен - это нормально!\n\nГлавное - продолжать 🌟",
    "Каждый день - это новая возможность начать заново 😊",
    "Вы уже прошли долгий путь - не теряйте мотивацию! ✨",
    "Небольшие трудности - часть большого пути к успеху 🚀",

    "«Измените свое окружение, чтобы сделать желаемое поведение более "
    "легким, а нежелательное - более сложным»\n\n«Атомные привычки», Джеймс Клир",

    "«Запланируйте, когда и где Вы будете выполнять определенные действия, "
    "чтобы повысить вероятность выполнения»\n\n«Атомные привычки», Джеймс Клир",

    "«Найдите оптимальный уровень сложности для привычки, чтобы она "
    "оставалась интересной, но достижимой»\n\n«Атомные привычки», Джеймс Клир",

    "«Четыре главных закона изменения поведения: сделайте это очевидным, "
    "привлекательным, легким и приятным, чтобы создавать и поддерживать "
    "привычки»\n\n«Атомные привычки», Джеймс Клир",

    "«Разбейте привычку на более мелкие, управляемые действия, чтобы "
    "преодолеть прокрастинацию»\n\n«Атомные привычки», Джеймс Клир",

    "«Рассматривайте неудачи как возможности для обучения и роста, "
    "а не как причины для отказа»\n\n«Атомные привычки», Джеймс Клир",

    "«Примите идею постоянного совершенствования и корректировки "
    "в стремлении к личностному росту»\n\n«Атомные привычки», Джеймс Клир",

    "«Сосредоточьтесь на небольших победах, ведь 1% лучше каждый день "
    "превращается в огромные результаты. Небольшие изменения - "
    "огромное влияние»\n\n«Атомные привычки», Джеймс Клир"
]

weekly_motivations = [
            "Отличная неделя! 🎉\n\nПродолжайте развивать свои привычки!",
            "Неделя подошла к концу — вы справились! 💪\n\nГотовьтесь к новым победам!",
            "Удивительные результаты за неделю! ✨\n\nСкоро начнётся новый этап!",
            "Ваша неделя была продуктивной! 🌟\n\nСохраняйте этот темп!",
            "Неделя завершена — Вы молодец! 😊\n\nСледующая неделя — новые возможности!",
            "Великолепная неделя достижений! 🚀\n\nПродолжайте в том же духе!"
                    ]

daily_motivations = [
    "Продолжайте в том же духе! 💪",
    "Каждый день — шаг к вашей цели! 🌟",
    "Вы молодец! Не останавливайтесь! 😊",
    "Отличная работа! Так держать! 🎉",
    "Ваша настойчивость вдохновляет! ✨",
    "Маленькие шаги ведут к большим результатам! 🚀",

    "«Быть несчастным, это привычка. Быть счастливым, это тоже привычка. "
    "Выбор за Вами»\n\n© Том Хопкинс",

    "«Каждый ваш успех или поражение целиком и полностью определяются "
    "образом жизни и устоявшимися привычками»\n\n© Наполеон Хилл",

    "«Привычка. Вот проблема. Всё, что тебе нужно, — это быть осознанным "
    "в своём и ответственным за свои действия»\n\n© Фильм «Мирный воин»",

    "«Мы – рабы своих привычек. Измени своих привычки, и изменится "
    "твоя жизнь…»\n\n© Роберт Кийосаки",

    "«Привычка – вторая натура»\n\n© Аристотель",

    "«Между неудачником и человеком преуспевающим есть лишь одно отличие — "
    "разница в их привычках. Добрые привычки — ключ к любому успеху, "
    "худые привычки — наглухо закрытая дверь в будущее»\n\n© Ог Мандиго",
    
    "«Привычка свыше нам дана: замена счастию она»\n\n© Александр Сергеевич Пушкин"
]


# Изменени свое окружения, чтобы сделать желаемое поведение более легким, а нежелательное - более сложным.
# Запланируйте, когда и где Вы будете выполнять определенные действия, чтобы повысить вероятность выполнения.
# Найдите оптимальный уровень сложности для привычки, чтобы она оставалась интересной, но достижимой.
# Четыре главныйх закона изменения поведения: сделайте это очевидным, привлекательным, легким и приятным, чтобы создавать и поддерживать привычки.
# Разбейте привычку на более мелкие, управляемые действия, чтобы преодолеть прокрастинацию.
# Рассматривайте неудачи как возможности для обучения и роста, а не как причины для отказа.
# Примите идею постоянного совершенствования и корректировки в стремлении к личностному росту.
# Сосредоточтесь на небольших победах, ведь 1% лучше каждый день превращается в огромные результаты. Небольшие изменения - огромное влияние.

# «Быть несчастным, это привычка. Быть счастливым, это тоже привычка. Выбор за Вами». - Том Хопкинс
# «Каждый ваш успех или поражение целиком и полностью определяются образом жизни и устоявшимися привычками». - Наполеон Хилл
# «Привычка. Вот проблема. Всё, что тебе нужно, — это быть осознанным в своём и ответственным за свои действия». - Фильм «Мирный воин».
# «Мы – рабы своих привычек. Измени своих привычки, и изменится твоя жизнь…». - Роберт Кийосаки
# «Привычка – вторая натура». - Аристотель
# «Между неудачником и человеком преуспевающим есть лишь одно отличие — разница в их привычках. Добрые привычки — ключ к любому успеху, худые привычки — наглухо закрытая дверь в будущее». - Ог Мандиго
# «Привычка свыше нам дана: замена счастию она». - Александр Сергеевич Пушкин